artillerytest.yml
# run this test by executing npm run loadtester artillerytest.yml in a powershell terminal

config:
  target: "http://localhost:4200/"
  phases:
  - duration: 600 # the time of one phase
    arrivalRate: 50 # the number of users added each second
    name: Warm up
  - duration: 120
    arrivalRate: 5
    rampTo: 50 # up to how many users per second the load will grow by
    name: Ramp up load
  - duration: 600
    arrivalRate: 50
    name: Sustained load
  ensure:
    maxErrorRate: 1
    max: 500

scenarios:
  - name: "Get product"
    flow:
      - get:
          url: "/products/detail/1"